; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v5 ?v4)
             (pred_3 ?v10 ?v8)
             (pred_2 ?v5 ?v8)
             (pred_10 ?v1 ?v5 )
	     (pred_9 ?v5)
             (pred_1 ?v6)
             (pred_12 ?v10)
             (pred_5 ?v8)
             (pred_6 ?v5)
             (pred_8 ?v10)
             (pred_7 ?v5)
             (pred_11 ))



(:action op_4
:parameters (?v12 ?v13 ?v7 ?v3)
:precondition (and (pred_1 ?v12) (pred_1 ?v13) (pred_12 ?v7) (pred_5 ?v3)
          (pred_4 ?v12 ?v13) (pred_3 ?v7 ?v3)
                   (pred_2 ?v13 ?v3) (pred_9 ?v12) 
                   (pred_6 ?v13) (pred_8 ?v7))
:effect (and  (pred_7 ?v13) (not (pred_6 ?v13))))


(:action op_3
:parameters (?v12 ?v9)
:precondition (and (pred_1 ?v12) (pred_1 ?v9)
               (pred_9 ?v12) (pred_4 ?v12 ?v9) (pred_7 ?v9))
:effect (and (pred_9 ?v9) (not (pred_9 ?v12))))

(:action op_1
:parameters (?v12 ?v7)
:precondition (and (pred_1 ?v12) (pred_12 ?v7) 
                  (pred_9 ?v12) (pred_10 ?v7 ?v12) (pred_11 ))
:effect (and (pred_8 ?v7)
   (not (pred_10 ?v7 ?v12)) (not (pred_11 ))))


(:action op_5
:parameters (?v12 ?v11 ?v2)
:precondition (and (pred_1 ?v12) (pred_12 ?v11) (pred_12 ?v2)
                  (pred_9 ?v12) (pred_8 ?v2) (pred_10 ?v11 ?v12))
:effect (and (pred_8 ?v11) (pred_10 ?v2 ?v12)
        (not (pred_8 ?v2)) (not (pred_10 ?v11 ?v12))))

(:action op_2
:parameters (?v12 ?v7)
:precondition (and (pred_1 ?v12) (pred_12 ?v7) 
                  (pred_9 ?v12) (pred_8 ?v7))
:effect (and (pred_11 ) (pred_10 ?v7 ?v12) (not (pred_8 ?v7)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_16 obj_23 obj_25 obj_01 obj_21 obj_04 obj_09 obj_08 obj_03 obj_10 obj_24 obj_32 obj_31 obj_05 obj_28 obj_13 obj_12 obj_18 obj_02 obj_07 obj_17 obj_29 obj_14 obj_06 obj_11
    obj_22 obj_30 obj_19
    obj_26 obj_15 obj_27 obj_20
    )

    (:init
       (pred_11)

       (pred_1 obj_16)
       (pred_1 obj_23)
       (pred_1 obj_25)
       (pred_1 obj_01)
       (pred_1 obj_21)
       (pred_1 obj_04)
       (pred_1 obj_09)
       (pred_1 obj_08)
       (pred_1 obj_03)
       (pred_1 obj_10)
       (pred_1 obj_24)
       (pred_1 obj_32)
       (pred_1 obj_31)
       (pred_1 obj_05)
       (pred_1 obj_28)
       (pred_1 obj_13)
       (pred_1 obj_12)
       (pred_1 obj_18)
       (pred_1 obj_02)
       (pred_1 obj_07)
       (pred_1 obj_17)
       (pred_1 obj_29)
       (pred_1 obj_14)
       (pred_1 obj_06)
       (pred_1 obj_11)
       (pred_5 obj_22)
       (pred_5 obj_30)
       (pred_5 obj_19)
       (pred_12 obj_26)
       (pred_12 obj_15)
       (pred_12 obj_27)
       (pred_12 obj_20)

       (pred_4 obj_16 obj_04)
       (pred_4 obj_16 obj_23)
       (pred_4 obj_23 obj_09)
       (pred_4 obj_23 obj_25)
       (pred_4 obj_23 obj_16)
       (pred_4 obj_25 obj_08)
       (pred_4 obj_25 obj_01)
       (pred_4 obj_25 obj_23)
       (pred_4 obj_01 obj_03)
       (pred_4 obj_01 obj_21)
       (pred_4 obj_01 obj_25)
       (pred_4 obj_21 obj_10)
       (pred_4 obj_21 obj_01)
       (pred_4 obj_04 obj_24)
       (pred_4 obj_04 obj_09)
       (pred_4 obj_04 obj_16)
       (pred_4 obj_09 obj_32)
       (pred_4 obj_09 obj_08)
       (pred_4 obj_09 obj_23)
       (pred_4 obj_09 obj_04)
       (pred_4 obj_08 obj_31)
       (pred_4 obj_08 obj_03)
       (pred_4 obj_08 obj_25)
       (pred_4 obj_08 obj_09)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_03 obj_01)
       (pred_4 obj_03 obj_08)
       (pred_4 obj_10 obj_28)
       (pred_4 obj_10 obj_21)
       (pred_4 obj_10 obj_03)
       (pred_4 obj_24 obj_13)
       (pred_4 obj_24 obj_32)
       (pred_4 obj_24 obj_04)
       (pred_4 obj_32 obj_12)
       (pred_4 obj_32 obj_31)
       (pred_4 obj_32 obj_09)
       (pred_4 obj_32 obj_24)
       (pred_4 obj_31 obj_18)
       (pred_4 obj_31 obj_05)
       (pred_4 obj_31 obj_08)
       (pred_4 obj_31 obj_32)
       (pred_4 obj_05 obj_02)
       (pred_4 obj_05 obj_28)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_05 obj_31)
       (pred_4 obj_28 obj_07)
       (pred_4 obj_28 obj_10)
       (pred_4 obj_28 obj_05)
       (pred_4 obj_13 obj_17)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_13 obj_24)
       (pred_4 obj_12 obj_29)
       (pred_4 obj_12 obj_18)
       (pred_4 obj_12 obj_32)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_18 obj_14)
       (pred_4 obj_18 obj_02)
       (pred_4 obj_18 obj_31)
       (pred_4 obj_18 obj_12)
       (pred_4 obj_02 obj_06)
       (pred_4 obj_02 obj_07)
       (pred_4 obj_02 obj_05)
       (pred_4 obj_02 obj_18)
       (pred_4 obj_07 obj_11)
       (pred_4 obj_07 obj_28)
       (pred_4 obj_07 obj_02)
       (pred_4 obj_17 obj_29)
       (pred_4 obj_17 obj_13)
       (pred_4 obj_29 obj_14)
       (pred_4 obj_29 obj_12)
       (pred_4 obj_29 obj_17)
       (pred_4 obj_14 obj_06)
       (pred_4 obj_14 obj_18)
       (pred_4 obj_14 obj_29)
       (pred_4 obj_06 obj_11)
       (pred_4 obj_06 obj_02)
       (pred_4 obj_06 obj_14)
       (pred_4 obj_11 obj_07)
       (pred_4 obj_11 obj_06)
       (pred_6 obj_25)
       (pred_6 obj_16)
       (pred_6 obj_24)
       (pred_6 obj_04)
       (pred_2  obj_25 obj_22)
       (pred_2  obj_16 obj_30)
       (pred_2  obj_24 obj_19)
       (pred_2  obj_04 obj_19)
       (pred_7 obj_23)
       (pred_7 obj_01)
       (pred_7 obj_21)
       (pred_7 obj_09)
       (pred_7 obj_08)
       (pred_7 obj_03)
       (pred_7 obj_10)
       (pred_7 obj_32)
       (pred_7 obj_31)
       (pred_7 obj_05)
       (pred_7 obj_28)
       (pred_7 obj_13)
       (pred_7 obj_12)
       (pred_7 obj_18)
       (pred_7 obj_02)
       (pred_7 obj_07)
       (pred_7 obj_17)
       (pred_7 obj_29)
       (pred_7 obj_14)
       (pred_7 obj_06)
       (pred_7 obj_11)

       (pred_3  obj_26 obj_22)
       (pred_3  obj_15 obj_30)
       (pred_3  obj_27 obj_19)
       (pred_3  obj_20 obj_19)
       (pred_10 obj_26 obj_24)
       (pred_10 obj_15 obj_23)
       (pred_10 obj_27 obj_06)
       (pred_10 obj_20 obj_29)
       (pred_9 obj_02)
    )

    (:goal (and
       (pred_10 obj_27 obj_21)
       (pred_10 obj_20 obj_32)
    ))
(:constraints
  (always (not (pred_9 obj_12)))
)
)

; plan
1. (op_3 obj_02 obj_06)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_06)
   goals met: 0 of 2
2. (op_1 obj_06 obj_27)
   deleted: (pred_10 obj_27 obj_06) (pred_11)
   added: (pred_8 obj_27)
   goals met: 0 of 2
3. (op_3 obj_06 obj_14)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_14)
   goals met: 0 of 2
4. (op_2 obj_14 obj_27)
   deleted: (pred_8 obj_27)
   added: (pred_11) (pred_10 obj_27 obj_14)
   goals met: 0 of 2
5. (op_3 obj_14 obj_29)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_29)
   goals met: 0 of 2
6. (op_1 obj_29 obj_20)
   deleted: (pred_10 obj_20 obj_29) (pred_11)
   added: (pred_8 obj_20)
   goals met: 0 of 2
7. (op_3 obj_29 obj_14)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_14)
   goals met: 0 of 2
8. (op_3 obj_14 obj_18)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_18)
   goals met: 0 of 2
9. (op_3 obj_18 obj_31)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_31)
   goals met: 0 of 2
10. (op_3 obj_31 obj_32)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_32)
   goals met: 0 of 2
11. (op_2 obj_32 obj_20)
   deleted: (pred_8 obj_20)
   added: (pred_11) (pred_10 obj_20 obj_32)
   goals met: 1 of 2
12. (op_3 obj_32 obj_31)
   deleted: (pred_9 obj_32)
   added: (pred_9 obj_31)
   goals met: 1 of 2
13. (op_3 obj_31 obj_18)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_18)
   goals met: 1 of 2
14. (op_3 obj_18 obj_14)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_14)
   goals met: 1 of 2
15. (op_1 obj_14 obj_27)
   deleted: (pred_10 obj_27 obj_14) (pred_11)
   added: (pred_8 obj_27)
   goals met: 1 of 2
16. (op_3 obj_14 obj_18)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_18)
   goals met: 1 of 2
17. (op_3 obj_18 obj_31)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_31)
   goals met: 1 of 2
18. (op_3 obj_31 obj_08)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_08)
   goals met: 1 of 2
19. (op_3 obj_08 obj_03)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_03)
   goals met: 1 of 2
20. (op_3 obj_03 obj_01)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_01)
   goals met: 1 of 2
21. (op_3 obj_01 obj_21)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_21)
   goals met: 1 of 2
22. (op_2 obj_21 obj_27)
   deleted: (pred_8 obj_27)
   added: (pred_11) (pred_10 obj_27 obj_21)
   goals met: 2 of 2
